# 2661 좋은수열 (G4)
# https://www.acmicpc.net/problem/2661
# 정답


n = int(input())

def recur(k, seq):
    for i in range(k//2):
        if seq[-i-1:] == seq[-2-i-i:-1-i]: return
    if k == n:
        print(seq)
        exit(0)
    recur(k+1, seq+'1')
    recur(k+1, seq+'2')
    recur(k+1, seq+'3')

recur(1,'1')

# 접근 1
# 한 자리 숫자를 늘려가면서 만들어지는 좋은 수열은 정해져 있을 것이다
# -> 그리디하게 부분을 만들어가면서 답을 얻을 수 있을 것 같다.
# 반례 1213121
# 7에서는 이게 답이지만 이후 8을 만들 수가 없음

# 접근 2
# 백트래킹으로 풀자
# 한 글자씩 나가가 단계씩 나아간다.
# 모든 경우를 고려하긴 하지만 불필요한 경우는 빠르게 되돌아가기
# 대체로 답이 정해져나오겠지만
# 최악의 경우 대략 80 ^ 3 = 512000, 가능!
# 성공
