# 16638 괄호 추가하기 2 (G1)
# https://www.acmicpc.net/problem/16638
# 정답


n = int(input())
lst = input()
ans = -1e11

def recur(start, flag, buf):
    global ans

    tmp = lst
    for i in buf: tmp = tmp[:i-1] + '(' + tmp[i-1:i+2] + ')' + tmp[i+2:]
    ans = max(ans, eval(tmp))

    for i in range(start, n//2):
        if (flag & 1<<i) or (flag & 1<<i+1) or (i and flag & 1<<i-1): continue
        recur(i+1, flag | 1<<i, [2*i+1]+buf)

recur(0,0,[])
print(ans)

# 접근 1
# 연산자들을 기준으로 해서 순서를 지정해주자
# 그다음에 그 연산자들의 순서에 맞게 괄호를 쳐주면 되겠다
# 괄호는 어떻게 치지?
# 계산에 사용할 연산자의 인덱스를 찾는다
# 그 인덱스를 기준으로 새로운 연산자가 나타날 때까지 양옆으로 인덱스를 탐색하며 좌우 괄호칠 인덱스를 찾는다
# -> 중첩 괄호 케이스 발생

# 접근 2
# 순서를 지정할 게 아니라 괄호 칠 녀석들을 정확하게 고르는 게 맞다
# 순열이 아니라 조건에 맞는 부분집합을 찾는 문제다
# 그 조건은 괄호를 치기로 한(선택한) 바로 옆의 연산자는 괄호를 치면 안 된다는 것.
# 플래그를 잘 사용하면 되겠다.
# -> 성공

# 접근 3
# 인덱스 찾는 로직 너무 귀찮다;
# 다른 사람 풀이 보니까 괄호를 뒤에서부터 치면 접근하고자하는 인덱스가 변동되는 일이 발생하지 않는다!
# 코드 대폭 줄일 수 있겠다!
# -> 성공
